// Курс: Java. Знакомство и как пользоваться базовым API
// Урок 5. Хранение и обработка данных ч2: множество коллекций Map

// Задание 2
// Даны 2 строки, написать метод, который вернет true, если строки являются изоморфными и false если нет.
// Строки изоморфны если одну букву в первом слове можно заменить на некоторую букву во втором слове, при этом
// - повторяющиеся буквы одного слова меняются на одну и ту же букву с сохранением порядка следования ("add" и "egg" изомофны)
// - буква может не меняться, а остаться такой же ("note" и "code")

public class Main
{
    public static void main(String[] args)
    {

    }
}